Script started on 2020-03-13 21:22:36-0700
]0;mlclub@mlclub-VirtualBox: ~/cs1b/hw05[01;32mmlclub@mlclub-VirtualBox[00m:[01;34m~/cs1b/hw05[00m$ gdb s15
GNU gdb (Ubuntu 8.1-0ubuntu3) 8.1.0.20180409-git
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from s15...done.
(gdb) break ""1"
Breakpoint 1 at 0x8d2: file s15.cpp, line 1.
(gdb) l
1	//
2	// Created by Carlos Aguilera on 3/5/20.
3	//
4	
5	#include "hw05.h"
6	
7	int main() {
8	    int d[5] = {1,2,3,4,5};
9	    int s;
10	// i n i t i a l i z e d [ ]
(gdb) s
The program is not being run.
(gdb) r
Starting program: /home/mlclub/cs1b/hw05/s15 

Breakpoint 1, main () at s15.cpp:7
7	int main() {
(gdb) s
8	    int d[5] = {1,2,3,4,5};
(gdb) s
11	    s = Sum(d,5);
(gdb) s
Sum (p=0x7fffffffde50, k=5) at s15f.cpp:9
9	    int sum = 0;
(gdb) l
4	
5	#include "hw05.h"
6	
7	int Sum(int *p, int k) {
8	    int i;
9	    int sum = 0;
10	    for(i=0;i<k;++i) {
11	        sum += *(p+i);
12	    }
13	    return sum;
(gdb) brak
Undefined command: "brak".  Try "help".
(gdb) break ""1"2"
Breakpoint 2 at 0x5555555549f4: file s15f.cpp, line 12.
(gdb) s
10	    for(i=0;i<k;++i) {
(gdb) s
11	        sum += *(p+i);
(gdb) p sum
$1 = 0
(gdb) p &sum
$2 = (int *) 0x7fffffffde2c
(gdb) p 1
$3 = 1
(gdb) s
10	    for(i=0;i<k;++i) {
(gdb) s
11	        sum += *(p+i);
(gdb) p sum
$4 = 1
(gdb) p &sum
$5 = (int *) 0x7fffffffde2c
(gdb) s
10	    for(i=0;i<k;++i) {
(gdb) s
11	        sum += *(p+i);
(gdb) p sum
$6 = 3
(gdb) p &sum
$7 = (int *) 0x7fffffffde2c
(gdb) c
Continuing.

Breakpoint 2, Sum (p=0x7fffffffde50, k=5) at s15f.cpp:13
13	    return sum;
(gdb) s
14	}(gdb) s
main () at s15.cpp:12
12	    cout << "s: " << s;
(gdb) p s
$8 = 15
(gdb) p &s
$9 = (int *) 0x7fffffffde4c
(gdb) s
13	    return 0;
(gdb) s
14	}(gdb) s
__libc_start_main (main=0x5555555548ca <main()>, argc=1, argv=0x7fffffffdf58, init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7fffffffdf48) at ../csu/libc-start.c:344
344	../csu/libc-start.c: No such file or directory.
(gdb) q
A debugging session is active.

	Inferior 1 [process 7245] will be killed.

Quit anyway? (y or n) y
]0;mlclub@mlclub-VirtualBox: ~/cs1b/hw05[01;32mmlclub@mlclub-VirtualBox[00m:[01;34m~/cs1b/hw05[00m$ exit

Script done on 2020-03-13 21:26:39-0700
